import streamlit as st
import pandas as pd
import plotly.express as px
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
from datetime import datetime


import folium
from streamlit_folium import st_folium
import io

# Setting page configuration for Streamlit
st.set_page_config(page_title="Traffic Violations Analysis", layout="wide")


# Function to load and preprocess data
@st.cache_data
def load_data():
    df = pd.read_excel("output_onehot.xlsx")

    # Selecting relevant columns based on user requirements
    columns = [
        "Уртраг",
        "Өргөрөг",
        "Осол",
        "Зөрчил огноо",
        "Авто зам - Замын хучилт Тодорхойгүй",
        "Авто зам - Замын хучилт Асфальт",
        "Авто зам - Замын хучилт Бетон",
        "Авто зам - Замын хучилт Сайжруулсан",
        "Авто зам - Замын хучилт Хайрган",
        "Авто зам - Замын хучилт Хөрсөн",
        "Авто зам - Замын хучилт Цементэн",
        "Авто зам - Зорчих хэсгийн өргөн",
        "ГБХ: бусад зөрчил",
        "анхаарал болгоомжгүй зөрчил",
        "архидан согтуурсан зөрчил",
        "асран хамгаалагч зөрчил",
        "бусад зөрчил",
        "бэлдмэл хэрэглэсэн этгээдэд т/х-ийн жолоог шилжүүлсэн зөрчил",
        "бүрэн бус тээврийн хэрэгсэл жолоодсон зөрчил",
        "бүх шатны боловсролын/б-ын холбогдох албан тушаалтан 10 хүртэлх насны хүүхдийг харгалзах хүнгүйгээр ЗХ-д оролцуулсан зөрчил",
        "гадны гэрэл хэрэглэх зөрчил",
        "гарамгүй хэсгээр зам хөндлөн гарсан зөрчил",
        "гарц зөрчил",
        "гэрэл дохио зөрчсөн зөрчил",
        "гүйцэд түрүүлэх үйлдэл буруу зөрчил",
        "гүйцэж түрүүлэх үйлдэл буруу хийсэн зөрчил",
        "жолоодох чадваргүй үедээ зорчих хэсгээр явсан зөрчил",
        "жолоодох эрхээ хасуулсан этгээд эрхийн үнэмлэхгүй жолоодсон зөрчил",
        "зам: ЗХ-ний дүрмийг сахин биелүүлээгүй зөрчил",
        "зам: ЗХАБ-ыг хангаж чадахааргүй өвчтэй буюу ядарсан үедээ т/х жолоодож замын хөдөлгөөнд оролцсон зөрчил",
        "зам: ЗХАБ-ын эсрэг гэмт хэрэг зөрчил",
        "зам: Т/х жолоодох эрхгүй (жолоодлогын дадлага хийхээс бусад тохиолдолд) буюу эрхээ хасуулсан этгээдэд т/х-ийн жолоог шилжүүлсэн зөрчил",
        "зам: Эцэг эх зөрчил",
        "зам: гарц зөрчил",
        "зам: замын гэрэлтүүлэг хангалтгүй зөрчил",
        "зам: замын тэмдэг тэмдэглэл байхгүй байсан зөрчил",
        "зам: зогсолт зогсоолын журам зөрчсөн зөрчил",
        "зам: ойртон ирж яваа тээврийн хэрэгслийн урдуур гэнэт гүйсэн зөрчил",
        "зам: тэмдэг тэмдэглэл зөрчсөн зөрчил",
        "зам: явган хүний гарц ба гарамтай хэсгийн гарцгүй зөрчил",
        "замын гэрэлтүүлэг хангалтгүй зөрчил",
        "замын нөхцөлөөс зөрчил",
        "замын тэмдэг тэмдэглэл байхгүй байсан зөрчил",
        "зан харьцаа зөрчил",
        "зогсолт зогсоолын журам зөрчсөн зөрчил",
        "зогсоох арга хэмжээ аваагүй зөрчил",
        "зөрчлийн талаар холбогдох байгууллагад шуурхай мэдээлээгүй зөрчил",
        "мал хариулгагүй зөрчил",
        "нийтээр дагаж мөрдөх хэм хэмжээ зөрчсөн зөрчил",
        "ойртон ирж яваа тээврийн хэрэгслийн урдуур гэнэт гүйсэн зөрчил",
        "согтуугаар тээврийн хэрэгсэл жолоодсон зөрчил",
        "техникийн гэмтлээс замын нөхцөл байдлаас зөрчил",
        "уулзвар гарц нэвтрэх журам зөрчсөн зөрчил",
        "ухрах үйлдэл буруу хийсэн зөрчил",
        "хажуу хоорондын зай тохируулаагүй зөрчил",
        "хамгаалах бүс хэрэглээгүй зөрчил",
        "хувь хүний ёс суртахууны төлөвшил зөрчил",
        "хурд тохируулаагүй зөрчил",
        "хурд хэтрүүлсэн зөрчил",
        "хяналт шалгалт сул зөрчил",
        "хүн ба ачаа тээвэрлэх журам зөрчсөн зөрчил",
        "эвдэж сүйтгэсэн зөрчил",
        "эгнээ байр буруу эзэлсэн зөрчил",
        "эргэх үйлдэл буруу хийсэн зөрчил",
        "эрхийн үнэмлэхгүй этгээд тээврийн хэрэгсэл жолоодсон зөрчил",
        "эсрэг урсгалд орох зөрчил",
        "эсрэг урсгалд орсон зөрчил",
        "явган хүний гарц ба гарамтай хэсгийн гарцгүй хэсгээр гарсан зөрчил",
        "үүргээ зохих ёсоор биелүүлээгүй зөрчил",
        "өөрийгөө хянаж зөрчил",
        "Дүүрэг",
        "Аймаг",
        "Авто зам - Замын харьяалал Нийслэлийн чанартай авто зам",
        "Авто зам - Замын харьяалал Орон нутгийн чанартай авто зам",
        "Авто зам - Замын харьяалал Иргэн аж ахуйн нэгж, байгууллагын дотоодын зам",
        "Авто зам - Замын харьяалал Улсын чанартай авто зам",
        "Авто зам - Замын харьяалал Хувийн зам",
        "Авто зам - Замын харьяалал Олон улсын чанартай авто зам",
        "Авто зам - Замын харьяалал Тусгай зориулалтын зам",
        "Авто зам - Замын ангилал Хорооллын",
        "Авто зам - Замын ангилал Ердийн",
        "Авто зам - Замын ангилал Тууш",
        "Авто зам - Замын ангилал Хурдны",
        "Авто зам - Замын гадаргуу Хуурай",
        "Авто зам - Замын гадаргуу Мөстэй",
        "Авто зам - Замын гадаргуу Нойтон",
        "Авто зам - Замын гадаргуу Цастай",
        "Авто зам - Замын гадаргуу Эдрэлтэй",
        "Авто зам - Замын гадаргуу Бохирдсон",
        "Авто зам - Замын онцлог Тэгш",
        "Авто зам - Замын онцлог Уруу",
        "Авто зам - Замын онцлог Өгсүүр",
        "Авто зам - Замын онцлог Шулуун",
        "Авто зам - Замын онцлог Хазгай",
        "Авто зам - Замын онцлог Огцом эргэлттэй",
        "Авто зам - Замын онцлог Налуу",
        "Авто зам - Замын онцлог Алсуур эргэлттэй",
        "Авто зам - Үзэгдэх орчин Чөлөөтэй",
        "Авто зам - Үзэгдэх орчин Зорчих хэсэг гэрэлтүүлэггүй",
        "Авто зам - Үзэгдэх орчин Зорчих хэсэг гэрэгтүүлэгтэй",
        "Авто зам - Үзэгдэх орчин Хязгаарлагдмал",
        "Авто зам - Үзэгдэх орчин Хангалтгүй",
        "Авто зам - Үзэгдэх орчин Бүрэнхий",
        "Авто зам - Үзэгдэх орчин Саад байсан",
        "Авто зам - Үзэгдэх орчин Манантай",
        "Авто зам - Цаг агаар Таатай",
        "Авто зам - Цаг агаар Үүлэрхэг",
        "Авто зам - Цаг агаар Цастай",
        "Авто зам - Цаг агаар Шуургатай",
        "Авто зам - Цаг агаар Манантай",
        "Авто зам - Цаг агаар Бороотой",
        "Авто зам - Бусад Өдөр",
        "Авто зам - Бусад Суурин газар",
        "Авто зам - Бусад Шөнө",
        "Авто зам - Бусад Суурингийн гаднах",
        "Авто зам - Бусад Аж ахуйн нэгж - Бусад",
        "Авто зам - Бусад Гудамж талбай - бусад",
        "Авто зам - Бусад Бусад газар - Өвөлжөө",
        "Авто зам - Бусад Бусад газар - Хөдөө хээр",
        "Авто зам - Бусад Бусад газар - Бусад",
        "Авто зам - Бусад Гудамж талбай - ил зогсоол",
        "Авто зам - Бусад Гудамж талбай - төмөр зам",
        "Авто зам - Бусад Гудамж талбай - гэр хорооллын гудамж",
        "Авто зам - Бусад Олон нийтийн газар - бөөний худалдааны төв",
        "Авто зам - Бусад Олон нийтийн газар - бусад",
        "Авто зам - Бусад Гудамж талбай - автобусны буудал",
        "Авто зам - Бусад Гудамж талбай - орон сууцны хорооллын гудамж",
        "Авто зам - Бусад эмнэлэг хувийн өмчийн",
        "Авто зам - Бусад Бусад газар - Бэлчээр",
        "Авто зам - Бусад Олон нийтийн газар - авто вокзал",
        "Авто зам - Бусад Бусад газар - Хаваржаа",
        "Авто зам - Бусад Олон нийтийн газар - дэлгүүр",
        "Авто зам - Бусад шатахуун түгээх станц",
        "Авто зам - Бусад Гэр, орон сууц - хувийн байшин",
        "Авто зам - Бусад Бусад газар - Зуслан",
        "Авто зам - Бусад Бусад газар - Ойн сан бүхий газар",
        "Авто зам - Бусад Бусад газар - Хилийн бүс",
        "Авто зам - Бусад Бусад газар - Гол, усны ай сав газар",
        "Авто зам - Бусад Олон нийтийн газар - амралтын газар",
        "Авто зам - Бусад Гэр, орон сууц - гэр",
        "Авто зам - Бусад Бусад газар - Намаржаа",
        "Авто зам - Бусад засвар, үйлчилгээний газар",
        "Авто зам - Бусад Гэр, орон сууц - бусад",
        "Авто зам - Бусад Нийтийн тээвэр - галт тэрэг",
        "Авто зам - Бусад Бусад газар - Ашиглаж байгаа уурхай",
        "Авто зам - Бусад Гэр, орон сууц - орон сууцны байр",
        "Авто зам - Бусад Гэр, орон сууц - гарааш",
        "Авто зам - Бусад Бусад газар - Баригдаж байгаа барилга",
        "Авто зам - Бусад Олон нийтийн газар - нисэх онгоцны буудал",
        "Авто зам - Бусад Бусад газар - Гадаад улсад",
        "Авто зам - Бусад Бусад газар - Ашигт малтмалын орд газар",
        "Авто зам - Бусад Нийтийн тээвэр - том оврын автобус",
        "Авто зам - Бусад Олон нийтийн газар - төмөр замын вокзал",
        "Авто зам - Бусад эмнэлэг төрийн өмчийн",
        "Авто зам - Бусад Төрийн бус байгууллага - бусад",
        "Авто зам - Бусад Нийтийн тээвэр - нисэх онгоц",
        "Авто зам - Бусад АТМ",
        "Авто зам - Замын хэсэг Уулзвар",
        "Авто зам - Замын хэсэг Бусад",
        "Авто зам - Замын хэсэг Гүүр",
        "Авто зам - Замын хэсэг Автобусны буудал",
        "Авто зам - Замын хэсэг Гарц",
        "Авто зам - Замын хэсэг Хонгил",
        "Авто зам - Замын хэсэг Төмөр замын гарам",
        "Авто зам - Замын хэсэг Зорчих хэсэг",
        "Авто зам - Замын хэсэг Тусгаарлах зурвас",
        "Авто зам - Замын хэсэг Түр зам",
        "Авто зам - Замын хэсэг Явган хүний зам дээр",
        "Авто зам - Замын хэсэг Сургууль орчимын зам",
        "Авто зам - Замын хэсэг Зогсоолын талбай",
        "Авто зам - Замын хэсэг Зорчих хэсгийн хөвөө",
        "Авто зам - Замын хэсэг Туслах зам",
        "Авто зам - Замын хэсэг Зам, барилгын ажлын талбай",
        "Авто зам - Ослын ноцтой байдал Хөнгөн гэмтэл авсан осол",
        "Авто зам - Ослын ноцтой байдал Хүнд, хүндэвтэр гэмтэл авсан осол",
        "Авто зам - Ослын ноцтой байдал Хүн нас барсан осол",
        "Авто зам - Ослын ноцтой байдал Эд материалын хохиролтой осол",
        "Авто зам - Ослын ноцтой байдал Гэмтэл бэртэл аваагүй осол",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Зам дээр саад байсан",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Гэрэл шилжүүлээгүй",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Хэт ядарсанаас",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Согтуугаар тээврийн хэрэгсэл жолоодсоноос",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Нойрмоглосоноос",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Замын нөхцөлөөс",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Гар утас хэрэглэж байснаас",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Буруу дохио, анхааруулга өгсөн",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Замын гадаргуу хальтиргаа, гулгаатай",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Сэтгэл зүйн байдлаас",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Дугуйн зам байхгүй байснаас",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Зам орчин хангалтгүй байсанаас",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Эрхэлсэн ажил мэргэжилээс",
        "Авто зам - Осолд нөлөөлөх хүчин зүйл Мансуурсанаас",
        "Авто зам - Ослын нөхцөл Хоёр тээврийн хэрэгсэл холбогдсон осол",
        "Авто зам - Ослын нөхцөл Нэг тээврийн хэрэгсэл холбогдсон осол",
        "Авто зам - Ослын нөхцөл Гурав бас түүнээс дээш тээврийн хэрэгсэл холбогдсон осол",
    ]
    df = df[columns].copy()
    df["Зөрчил огноо"] = pd.to_datetime(df["Зөрчил огноо"], errors="coerce")

    df["Year"] = df["Зөрчил огноо"].dt.year
    df["Month"] = df["Зөрчил огноо"].dt.month
    df["Day"] = df["Зөрчил огноо"].dt.day_name()
    print(df["Year"])
    # Handling missing values
    df["Зөрчил огноо жил 2022"] = (df["Year"] == 2022).astype(int)
    df["Зөрчил огноо жил 2023"] = (df["Year"] == 2023).astype(int)
    df["Зөрчил огноо жил 2024"] = (df["Year"] == 2024).astype(int)
    # Дөрвөн жилийн нийлбэр биш, харин логик флаг
    df["Зөрчил огноо жил 2022-2024"] = df["Year"].between(2022, 2024).astype(int)

    # Converting road width to numeric
    def clean_road_width(width):
        if pd.isna(width):
            return np.nan
        if isinstance(width, (int, float)):
            return float(width)
        if isinstance(width, str):
            # Remove units and specific Mongolian phrases
            width = (
                width.replace("м", "")
                .replace("-ээс дээш", "")
                .replace("хүртэл", "")
                .replace(",", ".")
                .strip()
            )
            # Handle ranges like "7.0-9.0"
            if "-" in width:
                try:
                    low, high = map(float, width.split("-"))
                    return (low + high) / 2
                except ValueError:
                    return np.nan
            # Handle single values like "3.5" or "3.5 хүртэл"
            try:
                return float(width)
            except ValueError:
                return np.nan
        return np.nan

    df["Авто зам - Зорчих хэсгийн өргөн"] = df["Авто зам - Зорчих хэсгийн өргөн"].apply(
        clean_road_width
    )
    return df


# Function to create correlation matrix


def plot_correlation_matrix(df, title, columns):
    # Сонгосон баганууд one-hot encoded эсэхийг шалгаж хэрэглэгчдэд анхааруулга өгөх
    n_unique = df[columns].nunique()
    if all((n_unique == 2) | (n_unique == 1)):
        st.warning(
            "Сонгосон баганууд нь нэг категори хувьсагчийн one-hot encoded хэлбэр байна. "
            "Ийм тохиолдолд корреляци нь 0 эсвэл -1 байж болохыг анхаарна уу."
        )

    df_encoded = df[columns].copy()
    for col in df_encoded.columns:
        if df_encoded[col].dtype == "object":
            df_encoded[col] = pd.Categorical(df_encoded[col]).codes

    corr_matrix = df_encoded.corr()

    # Plotting heatmap
    fig, ax = plt.subplots(figsize=(max(8, 1.5 * len(columns)), max(6, 1.2 * len(columns))))
    sns.heatmap(
        corr_matrix, annot=True, cmap="coolwarm", vmin=-1, vmax=1, center=0, ax=ax, fmt=".3f"
    )
    plt.title(title)
    plt.tight_layout()
    return fig



# Loading data
df = load_data()

# Streamlit app structure
st.title("Зам тээврийн ослуудын шинжилгээ (2022-2024)")

st.header("1. Замын хөдөлгөөний ослуудын учир шалтгаанын тархалтын шинжилгээ")
st.write(
    "Зөрчлийн төрөл, замын нөхцөл, бусад хувьсагчдын хоорондын корреляцийг судлана. Хамгийн ихдээ 15 хувьсагчыг сонгоно"
)

# ----------- ШИНЭ multiselect хэсэг -----------
vars_for_corr = [
    "Year",
    "Зөрчил огноо жил 2022",
    "Зөрчил огноо жил 2023",
    "Зөрчил огноо жил 2024",
    "Авто зам - Замын хучилт Тодорхойгүй",
    "Авто зам - Замын хучилт Асфальт",
    "Авто зам - Замын хучилт Бетон",
    "Авто зам - Замын хучилт Сайжруулсан",
    "Авто зам - Замын хучилт Хайрган",
    "Авто зам - Замын хучилт Хөрсөн",
    "Авто зам - Замын хучилт Цементэн",
    "Авто зам - Зорчих хэсгийн өргөн",
    "ГБХ: бусад зөрчил",
    "анхаарал болгоомжгүй зөрчил",
    "архидан согтуурсан зөрчил",
    "асран хамгаалагч зөрчил",
    "бусад зөрчил",
    "бэлдмэл хэрэглэсэн этгээдэд т/х-ийн жолоог шилжүүлсэн зөрчил",
    "бүрэн бус тээврийн хэрэгсэл жолоодсон зөрчил",
    "бүх шатны боловсролын/б-ын холбогдох албан тушаалтан 10 хүртэлх насны хүүхдийг харгалзах хүнгүйгээр ЗХ-д оролцуулсан зөрчил",
    "гадны гэрэл хэрэглэх зөрчил",
    "гарамгүй хэсгээр зам хөндлөн гарсан зөрчил",
    "гарц зөрчил",
    "гэрэл дохио зөрчсөн зөрчил",
    "гүйцэд түрүүлэх үйлдэл буруу зөрчил",
    "гүйцэж түрүүлэх үйлдэл буруу хийсэн зөрчил",
    "жолоодох чадваргүй үедээ зорчих хэсгээр явсан зөрчил",
    "жолоодох эрхээ хасуулсан этгээд эрхийн үнэмлэхгүй жолоодсон зөрчил",
    "зам: ЗХ-ний дүрмийг сахин биелүүлээгүй зөрчил",
    "зам: ЗХАБ-ыг хангаж чадахааргүй өвчтэй буюу ядарсан үедээ т/х жолоодож замын хөдөлгөөнд оролцсон зөрчил",
    "зам: ЗХАБ-ын эсрэг гэмт хэрэг зөрчил",
    "зам: Т/х жолоодох эрхгүй (жолоодлогын дадлага хийхээс бусад тохиолдолд) буюу эрхээ хасуулсан этгээдэд т/х-ийн жолоог шилжүүлсэн зөрчил",
    "зам: Эцэг эх зөрчил",
    "зам: гарц зөрчил",
    "зам: замын гэрэлтүүлэг хангалтгүй зөрчил",
    "зам: замын тэмдэг тэмдэглэл байхгүй байсан зөрчил",
    "зам: зогсолт зогсоолын журам зөрчсөн зөрчил",
    "зам: ойртон ирж яваа тээврийн хэрэгслийн урдуур гэнэт гүйсэн зөрчил",
    "зам: тэмдэг тэмдэглэл зөрчсөн зөрчил",
    "зам: явган хүний гарц ба гарамтай хэсгийн гарцгүй зөрчил",
    "замын гэрэлтүүлэг хангалтгүй зөрчил",
    "замын нөхцөлөөс зөрчил",
    "замын тэмдэг тэмдэглэл байхгүй байсан зөрчил",
    "зан харьцаа зөрчил",
    "зогсолт зогсоолын журам зөрчсөн зөрчил",
    "зогсоох арга хэмжээ аваагүй зөрчил",
    "зөрчлийн талаар холбогдох байгууллагад шуурхай мэдээлээгүй зөрчил",
    "мал хариулгагүй зөрчил",
    "нийтээр дагаж мөрдөх хэм хэмжээ зөрчсөн зөрчил",
    "ойртон ирж яваа тээврийн хэрэгслийн урдуур гэнэт гүйсэн зөрчил",
    "согтуугаар тээврийн хэрэгсэл жолоодсон зөрчил",
    "техникийн гэмтлээс замын нөхцөл байдлаас зөрчил",
    "уулзвар гарц нэвтрэх журам зөрчсөн зөрчил",
    "ухрах үйлдэл буруу хийсэн зөрчил",
    "хажуу хоорондын зай тохируулаагүй зөрчил",
    "хамгаалах бүс хэрэглээгүй зөрчил",
    "хувь хүний ёс суртахууны төлөвшил зөрчил",
    "хурд тохируулаагүй зөрчил",
    "хурд хэтрүүлсэн зөрчил",
    "хяналт шалгалт сул зөрчил",
    "хүн ба ачаа тээвэрлэх журам зөрчсөн зөрчил",
    "эвдэж сүйтгэсэн зөрчил",
    "эгнээ байр буруу эзэлсэн зөрчил",
    "эргэх үйлдэл буруу хийсэн зөрчил",
    "эрхийн үнэмлэхгүй этгээд тээврийн хэрэгсэл жолоодсон зөрчил",
    "эсрэг урсгалд орох зөрчил",
    "эсрэг урсгалд орсон зөрчил",
    "явган хүний гарц ба гарамтай хэсгийн гарцгүй хэсгээр гарсан зөрчил",
    "үүргээ зохих ёсоор биелүүлээгүй зөрчил",
    "өөрийгөө хянаж зөрчил",
    "Дүүрэг",
    "Аймаг",
    "Авто зам - Замын харьяалал Нийслэлийн чанартай авто зам",
    "Авто зам - Замын харьяалал Орон нутгийн чанартай авто зам",
    "Авто зам - Замын харьяалал Иргэн аж ахуйн нэгж, байгууллагын дотоодын зам",
    "Авто зам - Замын харьяалал Улсын чанартай авто зам",
    "Авто зам - Замын харьяалал Хувийн зам",
    "Авто зам - Замын харьяалал Олон улсын чанартай авто зам",
    "Авто зам - Замын харьяалал Тусгай зориулалтын зам",
    "Авто зам - Замын ангилал Хорооллын",
    "Авто зам - Замын ангилал Ердийн",
    "Авто зам - Замын ангилал Тууш",
    "Авто зам - Замын ангилал Хурдны",
    "Авто зам - Замын гадаргуу Хуурай",
    "Авто зам - Замын гадаргуу Мөстэй",
    "Авто зам - Замын гадаргуу Нойтон",
    "Авто зам - Замын гадаргуу Цастай",
    "Авто зам - Замын гадаргуу Эдрэлтэй",
    "Авто зам - Замын гадаргуу Бохирдсон",
    "Авто зам - Замын онцлог Тэгш",
    "Авто зам - Замын онцлог Уруу",
    "Авто зам - Замын онцлог Өгсүүр",
    "Авто зам - Замын онцлог Шулуун",
    "Авто зам - Замын онцлог Хазгай",
    "Авто зам - Замын онцлог Огцом эргэлттэй",
    "Авто зам - Замын онцлог Налуу",
    "Авто зам - Замын онцлог Алсуур эргэлттэй",
    "Авто зам - Үзэгдэх орчин Чөлөөтэй",
    "Авто зам - Үзэгдэх орчин Зорчих хэсэг гэрэлтүүлэггүй",
    "Авто зам - Үзэгдэх орчин Зорчих хэсэг гэрэгтүүлэгтэй",
    "Авто зам - Үзэгдэх орчин Хязгаарлагдмал",
    "Авто зам - Үзэгдэх орчин Хангалтгүй",
    "Авто зам - Үзэгдэх орчин Бүрэнхий",
    "Авто зам - Үзэгдэх орчин Саад байсан",
    "Авто зам - Үзэгдэх орчин Манантай",
    "Авто зам - Цаг агаар Таатай",
    "Авто зам - Цаг агаар Үүлэрхэг",
    "Авто зам - Цаг агаар Цастай",
    "Авто зам - Цаг агаар Шуургатай",
    "Авто зам - Цаг агаар Манантай",
    "Авто зам - Цаг агаар Бороотой",
    "Авто зам - Бусад Өдөр",
    "Авто зам - Бусад Суурин газар",
    "Авто зам - Бусад Шөнө",
    "Авто зам - Бусад Суурингийн гаднах",
    "Авто зам - Бусад Аж ахуйн нэгж - Бусад",
    "Авто зам - Бусад Гудамж талбай - бусад",
    "Авто зам - Бусад Бусад газар - Өвөлжөө",
    "Авто зам - Бусад Бусад газар - Хөдөө хээр",
    "Авто зам - Бусад Бусад газар - Бусад",
    "Авто зам - Бусад Гудамж талбай - ил зогсоол",
    "Авто зам - Бусад Гудамж талбай - төмөр зам",
    "Авто зам - Бусад Гудамж талбай - гэр хорооллын гудамж",
    "Авто зам - Бусад Олон нийтийн газар - бөөний худалдааны төв",
    "Авто зам - Бусад Олон нийтийн газар - бусад",
    "Авто зам - Бусад Гудамж талбай - автобусны буудал",
    "Авто зам - Бусад Гудамж талбай - орон сууцны хорооллын гудамж",
    "Авто зам - Бусад эмнэлэг хувийн өмчийн",
    "Авто зам - Бусад Бусад газар - Бэлчээр",
    "Авто зам - Бусад Олон нийтийн газар - авто вокзал",
    "Авто зам - Бусад Бусад газар - Хаваржаа",
    "Авто зам - Бусад Олон нийтийн газар - дэлгүүр",
    "Авто зам - Бусад шатахуун түгээх станц",
    "Авто зам - Бусад Гэр, орон сууц - хувийн байшин",
    "Авто зам - Бусад Бусад газар - Зуслан",
    "Авто зам - Бусад Бусад газар - Ойн сан бүхий газар",
    "Авто зам - Бусад Бусад газар - Хилийн бүс",
    "Авто зам - Бусад Бусад газар - Гол, усны ай сав газар",
    "Авто зам - Бусад Олон нийтийн газар - амралтын газар",
    "Авто зам - Бусад Гэр, орон сууц - гэр",
    "Авто зам - Бусад Бусад газар - Намаржаа",
    "Авто зам - Бусад засвар, үйлчилгээний газар",
    "Авто зам - Бусад Гэр, орон сууц - бусад",
    "Авто зам - Бусад Нийтийн тээвэр - галт тэрэг",
    "Авто зам - Бусад Бусад газар - Ашиглаж байгаа уурхай",
    "Авто зам - Бусад Гэр, орон сууц - орон сууцны байр",
    "Авто зам - Бусад Гэр, орон сууц - гарааш",
    "Авто зам - Бусад Бусад газар - Баригдаж байгаа барилга",
    "Авто зам - Бусад Олон нийтийн газар - нисэх онгоцны буудал",
    "Авто зам - Бусад Бусад газар - Гадаад улсад",
    "Авто зам - Бусад Бусад газар - Ашигт малтмалын орд газар",
    "Авто зам - Бусад Нийтийн тээвэр - том оврын автобус",
    "Авто зам - Бусад Олон нийтийн газар - төмөр замын вокзал",
    "Авто зам - Бусад эмнэлэг төрийн өмчийн",
    "Авто зам - Бусад Төрийн бус байгууллага - бусад",
    "Авто зам - Бусад Нийтийн тээвэр - нисэх онгоц",
    "Авто зам - Бусад АТМ",
    "Авто зам - Замын хэсэг Уулзвар",
    "Авто зам - Замын хэсэг Бусад",
    "Авто зам - Замын хэсэг Гүүр",
    "Авто зам - Замын хэсэг Автобусны буудал",
    "Авто зам - Замын хэсэг Гарц",
    "Авто зам - Замын хэсэг Хонгил",
    "Авто зам - Замын хэсэг Төмөр замын гарам",
    "Авто зам - Замын хэсэг Зорчих хэсэг",
    "Авто зам - Замын хэсэг Тусгаарлах зурвас",
    "Авто зам - Замын хэсэг Түр зам",
    "Авто зам - Замын хэсэг Явган хүний зам дээр",
    "Авто зам - Замын хэсэг Сургууль орчимын зам",
    "Авто зам - Замын хэсэг Зогсоолын талбай",
    "Авто зам - Замын хэсэг Зорчих хэсгийн хөвөө",
    "Авто зам - Замын хэсэг Туслах зам",
    "Авто зам - Замын хэсэг Зам, барилгын ажлын талбай",
    "Авто зам - Ослын ноцтой байдал Хөнгөн гэмтэл авсан осол",
    "Авто зам - Ослын ноцтой байдал Хүнд, хүндэвтэр гэмтэл авсан осол",
    "Авто зам - Ослын ноцтой байдал Хүн нас барсан осол",
    "Авто зам - Ослын ноцтой байдал Эд материалын хохиролтой осол",
    "Авто зам - Ослын ноцтой байдал Гэмтэл бэртэл аваагүй осол",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Зам дээр саад байсан",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Гэрэл шилжүүлээгүй",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Хэт ядарсанаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Согтуугаар тээврийн хэрэгсэл жолоодсоноос",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Нойрмоглосоноос",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Замын нөхцөлөөс",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Гар утас хэрэглэж байснаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Буруу дохио, анхааруулга өгсөн",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Замын гадаргуу хальтиргаа, гулгаатай",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Сэтгэл зүйн байдлаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Дугуйн зам байхгүй байснаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Зам орчин хангалтгүй байсанаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Эрхэлсэн ажил мэргэжилээс",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Мансуурсанаас",
    "Авто зам - Ослын нөхцөл Хоёр тээврийн хэрэгсэл холбогдсон осол",
    "Авто зам - Ослын нөхцөл Нэг тээврийн хэрэгсэл холбогдсон осол",
    "Авто зам - Ослын нөхцөл Гурав бас түүнээс дээш тээврийн хэрэгсэл холбогдсон осол",
]

# Хэрэглэгч өөрөө хувьсагч сонгоно
max_vars = 15
default_cols = vars_for_corr[:10]  # default 10-г харуулна
selected_cols = st.multiselect(
    f"Корреляцийн матрицад оруулах хувьсагчид (ихдээ {max_vars}):",
    vars_for_corr,
    default=default_cols,
    max_selections=max_vars,
)
if selected_cols:
    st.pyplot(plot_correlation_matrix(df, "Correlation Matrix", selected_cols))
else:
    st.warning("Сонгох хувьсагчидыг оруулна уу!")


# --- 2. Comparison of Violations Across Districts and Provinces ---
# 2-р хэсэг: Хар цэг илрүүлэлт, анализ, газрын зураг
st.header("2. Осол их гардаг хар цэгийн байршлууд")
st.write(
    "Ослын байршлуудыг доорх газрын зургаар харуулав. Дүүрэгт 30 метр радиус, Аймагт 1000 метр радиус"
)
# Байршлын координат багана байгаа бол нэрийг нь оруулна уу!
coord_cols = ["Уртраг", "Өргөрөг"]
if not all(c in df.columns for c in coord_cols):
    st.error("Координатын баганууд (Уртраг, Өргөрөг) байх шаардлагатай!")
    st.stop()

# Бинар хувьсагчийн жагсаалтыг таны өгсөнчлөн тохируулна
binary_cols = [
    "Авто зам - Замын хучилт Тодорхойгүй",
    "Авто зам - Замын хучилт Асфальт",
    "Авто зам - Замын хучилт Бетон",
    "Авто зам - Замын хучилт Сайжруулсан",
    "Авто зам - Замын хучилт Хайрган",
    "Авто зам - Замын хучилт Хөрсөн",
    "Авто зам - Замын хучилт Цементэн",
    "Авто зам - Зорчих хэсгийн өргөн",
    "ГБХ: бусад зөрчил",
    "анхаарал болгоомжгүй зөрчил",
    "архидан согтуурсан зөрчил",
    "асран хамгаалагч зөрчил",
    "бусад зөрчил",
    "бэлдмэл хэрэглэсэн этгээдэд т/х-ийн жолоог шилжүүлсэн зөрчил",
    "бүрэн бус тээврийн хэрэгсэл жолоодсон зөрчил",
    "бүх шатны боловсролын/б-ын холбогдох албан тушаалтан 10 хүртэлх насны хүүхдийг харгалзах хүнгүйгээр ЗХ-д оролцуулсан зөрчил",
    "гадны гэрэл хэрэглэх зөрчил",
    "гарамгүй хэсгээр зам хөндлөн гарсан зөрчил",
    "гарц зөрчил",
    "гэрэл дохио зөрчсөн зөрчил",
    "гүйцэд түрүүлэх үйлдэл буруу зөрчил",
    "гүйцэж түрүүлэх үйлдэл буруу хийсэн зөрчил",
    "жолоодох чадваргүй үедээ зорчих хэсгээр явсан зөрчил",
    "жолоодох эрхээ хасуулсан этгээд эрхийн үнэмлэхгүй жолоодсон зөрчил",
    "зам: ЗХ-ний дүрмийг сахин биелүүлээгүй зөрчил",
    "зам: ЗХАБ-ыг хангаж чадахааргүй өвчтэй буюу ядарсан үедээ т/х жолоодож замын хөдөлгөөнд оролцсон зөрчил",
    "зам: ЗХАБ-ын эсрэг гэмт хэрэг зөрчил",
    "зам: Т/х жолоодох эрхгүй (жолоодлогын дадлага хийхээс бусад тохиолдолд) буюу эрхээ хасуулсан этгээдэд т/х-ийн жолоог шилжүүлсэн зөрчил",
    "зам: Эцэг эх зөрчил",
    "зам: гарц зөрчил",
    "зам: замын гэрэлтүүлэг хангалтгүй зөрчил",
    "зам: замын тэмдэг тэмдэглэл байхгүй байсан зөрчил",
    "зам: зогсолт зогсоолын журам зөрчсөн зөрчил",
    "зам: ойртон ирж яваа тээврийн хэрэгслийн урдуур гэнэт гүйсэн зөрчил",
    "зам: тэмдэг тэмдэглэл зөрчсөн зөрчил",
    "зам: явган хүний гарц ба гарамтай хэсгийн гарцгүй зөрчил",
    "замын гэрэлтүүлэг хангалтгүй зөрчил",
    "замын нөхцөлөөс зөрчил",
    "замын тэмдэг тэмдэглэл байхгүй байсан зөрчил",
    "зан харьцаа зөрчил",
    "зогсолт зогсоолын журам зөрчсөн зөрчил",
    "зогсоох арга хэмжээ аваагүй зөрчил",
    "зөрчлийн талаар холбогдох байгууллагад шуурхай мэдээлээгүй зөрчил",
    "мал хариулгагүй зөрчил",
    "нийтээр дагаж мөрдөх хэм хэмжээ зөрчсөн зөрчил",
    "ойртон ирж яваа тээврийн хэрэгслийн урдуур гэнэт гүйсэн зөрчил",
    "согтуугаар тээврийн хэрэгсэл жолоодсон зөрчил",
    "техникийн гэмтлээс замын нөхцөл байдлаас зөрчил",
    "уулзвар гарц нэвтрэх журам зөрчсөн зөрчил",
    "ухрах үйлдэл буруу хийсэн зөрчил",
    "хажуу хоорондын зай тохируулаагүй зөрчил",
    "хамгаалах бүс хэрэглээгүй зөрчил",
    "хувь хүний ёс суртахууны төлөвшил зөрчил",
    "хурд тохируулаагүй зөрчил",
    "хурд хэтрүүлсэн зөрчил",
    "хяналт шалгалт сул зөрчил",
    "хүн ба ачаа тээвэрлэх журам зөрчсөн зөрчил",
    "эвдэж сүйтгэсэн зөрчил",
    "эгнээ байр буруу эзэлсэн зөрчил",
    "эргэх үйлдэл буруу хийсэн зөрчил",
    "эрхийн үнэмлэхгүй этгээд тээврийн хэрэгсэл жолоодсон зөрчил",
    "эсрэг урсгалд орох зөрчил",
    "эсрэг урсгалд орсон зөрчил",
    "явган хүний гарц ба гарамтай хэсгийн гарцгүй хэсгээр гарсан зөрчил",
    "үүргээ зохих ёсоор биелүүлээгүй зөрчил",
    "өөрийгөө хянаж зөрчил",
    "Дүүрэг",
    "Аймаг",
    "Авто зам - Замын харьяалал Нийслэлийн чанартай авто зам",
    "Авто зам - Замын харьяалал Орон нутгийн чанартай авто зам",
    "Авто зам - Замын харьяалал Иргэн аж ахуйн нэгж, байгууллагын дотоодын зам",
    "Авто зам - Замын харьяалал Улсын чанартай авто зам",
    "Авто зам - Замын харьяалал Хувийн зам",
    "Авто зам - Замын харьяалал Олон улсын чанартай авто зам",
    "Авто зам - Замын харьяалал Тусгай зориулалтын зам",
    "Авто зам - Замын ангилал Хорооллын",
    "Авто зам - Замын ангилал Ердийн",
    "Авто зам - Замын ангилал Тууш",
    "Авто зам - Замын ангилал Хурдны",
    "Авто зам - Замын гадаргуу Хуурай",
    "Авто зам - Замын гадаргуу Мөстэй",
    "Авто зам - Замын гадаргуу Нойтон",
    "Авто зам - Замын гадаргуу Цастай",
    "Авто зам - Замын гадаргуу Эдрэлтэй",
    "Авто зам - Замын гадаргуу Бохирдсон",
    "Авто зам - Замын онцлог Тэгш",
    "Авто зам - Замын онцлог Уруу",
    "Авто зам - Замын онцлог Өгсүүр",
    "Авто зам - Замын онцлог Шулуун",
    "Авто зам - Замын онцлог Хазгай",
    "Авто зам - Замын онцлог Огцом эргэлттэй",
    "Авто зам - Замын онцлог Налуу",
    "Авто зам - Замын онцлог Алсуур эргэлттэй",
    "Авто зам - Үзэгдэх орчин Чөлөөтэй",
    "Авто зам - Үзэгдэх орчин Зорчих хэсэг гэрэлтүүлэггүй",
    "Авто зам - Үзэгдэх орчин Зорчих хэсэг гэрэгтүүлэгтэй",
    "Авто зам - Үзэгдэх орчин Хязгаарлагдмал",
    "Авто зам - Үзэгдэх орчин Хангалтгүй",
    "Авто зам - Үзэгдэх орчин Бүрэнхий",
    "Авто зам - Үзэгдэх орчин Саад байсан",
    "Авто зам - Үзэгдэх орчин Манантай",
    "Авто зам - Цаг агаар Таатай",
    "Авто зам - Цаг агаар Үүлэрхэг",
    "Авто зам - Цаг агаар Цастай",
    "Авто зам - Цаг агаар Шуургатай",
    "Авто зам - Цаг агаар Манантай",
    "Авто зам - Цаг агаар Бороотой",
    "Авто зам - Бусад Өдөр",
    "Авто зам - Бусад Суурин газар",
    "Авто зам - Бусад Шөнө",
    "Авто зам - Бусад Суурингийн гаднах",
    "Авто зам - Бусад Аж ахуйн нэгж - Бусад",
    "Авто зам - Бусад Гудамж талбай - бусад",
    "Авто зам - Бусад Бусад газар - Өвөлжөө",
    "Авто зам - Бусад Бусад газар - Хөдөө хээр",
    "Авто зам - Бусад Бусад газар - Бусад",
    "Авто зам - Бусад Гудамж талбай - ил зогсоол",
    "Авто зам - Бусад Гудамж талбай - төмөр зам",
    "Авто зам - Бусад Гудамж талбай - гэр хорооллын гудамж",
    "Авто зам - Бусад Олон нийтийн газар - бөөний худалдааны төв",
    "Авто зам - Бусад Олон нийтийн газар - бусад",
    "Авто зам - Бусад Гудамж талбай - автобусны буудал",
    "Авто зам - Бусад Гудамж талбай - орон сууцны хорооллын гудамж",
    "Авто зам - Бусад эмнэлэг хувийн өмчийн",
    "Авто зам - Бусад Бусад газар - Бэлчээр",
    "Авто зам - Бусад Олон нийтийн газар - авто вокзал",
    "Авто зам - Бусад Бусад газар - Хаваржаа",
    "Авто зам - Бусад Олон нийтийн газар - дэлгүүр",
    "Авто зам - Бусад шатахуун түгээх станц",
    "Авто зам - Бусад Гэр, орон сууц - хувийн байшин",
    "Авто зам - Бусад Бусад газар - Зуслан",
    "Авто зам - Бусад Бусад газар - Ойн сан бүхий газар",
    "Авто зам - Бусад Бусад газар - Хилийн бүс",
    "Авто зам - Бусад Бусад газар - Гол, усны ай сав газар",
    "Авто зам - Бусад Олон нийтийн газар - амралтын газар",
    "Авто зам - Бусад Гэр, орон сууц - гэр",
    "Авто зам - Бусад Бусад газар - Намаржаа",
    "Авто зам - Бусад засвар, үйлчилгээний газар",
    "Авто зам - Бусад Гэр, орон сууц - бусад",
    "Авто зам - Бусад Нийтийн тээвэр - галт тэрэг",
    "Авто зам - Бусад Бусад газар - Ашиглаж байгаа уурхай",
    "Авто зам - Бусад Гэр, орон сууц - орон сууцны байр",
    "Авто зам - Бусад Гэр, орон сууц - гарааш",
    "Авто зам - Бусад Бусад газар - Баригдаж байгаа барилга",
    "Авто зам - Бусад Олон нийтийн газар - нисэх онгоцны буудал",
    "Авто зам - Бусад Бусад газар - Гадаад улсад",
    "Авто зам - Бусад Бусад газар - Ашигт малтмалын орд газар",
    "Авто зам - Бусад Нийтийн тээвэр - том оврын автобус",
    "Авто зам - Бусад Олон нийтийн газар - төмөр замын вокзал",
    "Авто зам - Бусад эмнэлэг төрийн өмчийн",
    "Авто зам - Бусад Төрийн бус байгууллага - бусад",
    "Авто зам - Бусад Нийтийн тээвэр - нисэх онгоц",
    "Авто зам - Бусад АТМ",
    "Авто зам - Замын хэсэг Уулзвар",
    "Авто зам - Замын хэсэг Бусад",
    "Авто зам - Замын хэсэг Гүүр",
    "Авто зам - Замын хэсэг Автобусны буудал",
    "Авто зам - Замын хэсэг Гарц",
    "Авто зам - Замын хэсэг Хонгил",
    "Авто зам - Замын хэсэг Төмөр замын гарам",
    "Авто зам - Замын хэсэг Зорчих хэсэг",
    "Авто зам - Замын хэсэг Тусгаарлах зурвас",
    "Авто зам - Замын хэсэг Түр зам",
    "Авто зам - Замын хэсэг Явган хүний зам дээр",
    "Авто зам - Замын хэсэг Сургууль орчимын зам",
    "Авто зам - Замын хэсэг Зогсоолын талбай",
    "Авто зам - Замын хэсэг Зорчих хэсгийн хөвөө",
    "Авто зам - Замын хэсэг Туслах зам",
    "Авто зам - Замын хэсэг Зам, барилгын ажлын талбай",
    "Авто зам - Ослын ноцтой байдал Хөнгөн гэмтэл авсан осол",
    "Авто зам - Ослын ноцтой байдал Хүнд, хүндэвтэр гэмтэл авсан осол",
    "Авто зам - Ослын ноцтой байдал Хүн нас барсан осол",
    "Авто зам - Ослын ноцтой байдал Эд материалын хохиролтой осол",
    "Авто зам - Ослын ноцтой байдал Гэмтэл бэртэл аваагүй осол",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Зам дээр саад байсан",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Гэрэл шилжүүлээгүй",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Хэт ядарсанаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Согтуугаар тээврийн хэрэгсэл жолоодсоноос",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Нойрмоглосоноос",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Замын нөхцөлөөс",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Гар утас хэрэглэж байснаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Буруу дохио, анхааруулга өгсөн",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Замын гадаргуу хальтиргаа, гулгаатай",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Сэтгэл зүйн байдлаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Дугуйн зам байхгүй байснаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Зам орчин хангалтгүй байсанаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Эрхэлсэн ажил мэргэжилээс",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Мансуурсанаас",
    "Авто зам - Ослын нөхцөл Хоёр тээврийн хэрэгсэл холбогдсон осол",
    "Авто зам - Ослын нөхцөл Нэг тээврийн хэрэгсэл холбогдсон осол",
    "Авто зам - Ослын нөхцөл Гурав бас түүнээс дээш тээврийн хэрэгсэл холбогдсон осол",
]
g = (
    df.groupby(["Уртраг", "Өргөрөг", "Дүүрэг", "Аймаг"])
    .agg(
        osol_count=("Осол", "sum"),
        dates=("Зөрчил огноо", lambda x: list(x)),
    )
    .reset_index()
)

district_hotspots = g[(g["Дүүрэг"] == 1) & (g["osol_count"] >= 3)].copy()
district_hotspots["radius"] = 30
province_hotspots = g[(g["Аймаг"] == 1) & (g["osol_count"] >= 2)].copy()
province_hotspots["radius"] = 1000

hotspots = pd.concat([district_hotspots, province_hotspots], ignore_index=True)


# Дундаж хоногийн зөрүү
def avg_days(dates):
    d = pd.Series(pd.to_datetime(dates)).sort_values()
    if len(d) > 1:
        days = d.diff().dt.total_seconds().dropna() / (3600 * 24)
        return np.round(days.mean(), 1)
    return np.nan


hotspots["avg_days"] = hotspots["dates"].apply(avg_days)

# Шалтгаан хувьсагч (numeric болгож mean тооцоолох)
cause_info = []
cause_info = []
for i, row in hotspots.iterrows():
    filt = (
        (df["Уртраг"] == row["Уртраг"])
        & (df["Өргөрөг"] == row["Өргөрөг"])
        & (df["Осол"] == 1)
    )
    # Багануудыг numeric болгож алдааг засна
    local_df = df.loc[filt, binary_cols].apply(pd.to_numeric, errors="coerce")
    if len(local_df) > 0:
        vals = local_df.mean().sort_values(ascending=False).head(3)
        # Топ 3 хувьсагчийг зөв нэр, дунджаар форматлана
        top_causes = "; ".join([f"{idx}: {val:.2f}" for idx, val in vals.items()])
        cause_info.append(top_causes)
    else:
        cause_info.append("")
hotspots["Шалтгаан"] = cause_info

# Газрын зураг үүсгэх
if hotspots.empty:
    st.info("Хар цэг олдсонгүй.")
else:
    m = folium.Map(
        location=[hotspots["Өргөрөг"].mean(), hotspots["Уртраг"].mean()], zoom_start=12
    )
    for _, row in hotspots.iterrows():
        folium.Circle(
            location=[row["Өргөрөг"], row["Уртраг"]],
            radius=row["radius"],
            color="red" if row["radius"] == 30 else "blue",
            fill=True,
            fill_opacity=0.5,
            popup=folium.Popup(
                f"""Осол: {int(row["osol_count"])} <br>
                Дундаж хоногийн зай: {row["avg_days"]} <br>
                Шалтгаан: {row["Шалтгаан"]}
                """,
                
                max_width=400,
            ),
        ).add_to(m)
    st.subheader("Осол ихтэй хар цэгүүд")
    st_folium(m, width=1920, height=800)

    out = hotspots.copy()
    out["Зөрчил огноо"] = out["dates"].apply(
        lambda d: ", ".join(pd.Series(d).astype(str).tolist())
    )
    out = out[
        [
            "Уртраг",
            "Өргөрөг",
            "Дүүрэг",
            "Аймаг",
            "osol_count",
            "avg_days",
            "Шалтгаан",
            "Зөрчил огноо",
            "radius",
        ]
    ]
    buffer = io.BytesIO()
    with pd.ExcelWriter(buffer, engine="xlsxwriter") as writer:
        out.to_excel(writer, index=False, sheet_name="hotspots")
    buffer.seek(0)
    st.download_button(
        label="Хар цэгийн Excel татах",
        data=buffer,
        file_name="hotspots.xlsx",
        mime="application/vnd.openxmlformats-officedocument.spreadsheetml.sheet",
    )





categorical_cols = [    "Авто зам - Замын хучилт Тодорхойгүй",
    "Авто зам - Замын хучилт Асфальт",
    "Авто зам - Замын хучилт Бетон",
    "Авто зам - Замын хучилт Сайжруулсан",
    "Авто зам - Замын хучилт Хайрган",
    "Авто зам - Замын хучилт Хөрсөн",
    "Авто зам - Замын хучилт Цементэн",
    "Авто зам - Зорчих хэсгийн өргөн",
    "ГБХ: бусад зөрчил",
    "анхаарал болгоомжгүй зөрчил",
    "архидан согтуурсан зөрчил",
    "асран хамгаалагч зөрчил",
    "бусад зөрчил",
    "бэлдмэл хэрэглэсэн этгээдэд т/х-ийн жолоог шилжүүлсэн зөрчил",
    "бүрэн бус тээврийн хэрэгсэл жолоодсон зөрчил",
    "бүх шатны боловсролын/б-ын холбогдох албан тушаалтан 10 хүртэлх насны хүүхдийг харгалзах хүнгүйгээр ЗХ-д оролцуулсан зөрчил",
    "гадны гэрэл хэрэглэх зөрчил",
    "гарамгүй хэсгээр зам хөндлөн гарсан зөрчил",
    "гарц зөрчил",
    "гэрэл дохио зөрчсөн зөрчил",
    "гүйцэд түрүүлэх үйлдэл буруу зөрчил",
    "гүйцэж түрүүлэх үйлдэл буруу хийсэн зөрчил",
    "жолоодох чадваргүй үедээ зорчих хэсгээр явсан зөрчил",
    "жолоодох эрхээ хасуулсан этгээд эрхийн үнэмлэхгүй жолоодсон зөрчил",
    "зам: ЗХ-ний дүрмийг сахин биелүүлээгүй зөрчил",
    "зам: ЗХАБ-ыг хангаж чадахааргүй өвчтэй буюу ядарсан үедээ т/х жолоодож замын хөдөлгөөнд оролцсон зөрчил",
    "зам: ЗХАБ-ын эсрэг гэмт хэрэг зөрчил",
    "зам: Т/х жолоодох эрхгүй (жолоодлогын дадлага хийхээс бусад тохиолдолд) буюу эрхээ хасуулсан этгээдэд т/х-ийн жолоог шилжүүлсэн зөрчил",
    "зам: Эцэг эх зөрчил",
    "зам: гарц зөрчил",
    "зам: замын гэрэлтүүлэг хангалтгүй зөрчил",
    "зам: замын тэмдэг тэмдэглэл байхгүй байсан зөрчил",
    "зам: зогсолт зогсоолын журам зөрчсөн зөрчил",
    "зам: ойртон ирж яваа тээврийн хэрэгслийн урдуур гэнэт гүйсэн зөрчил",
    "зам: тэмдэг тэмдэглэл зөрчсөн зөрчил",
    "зам: явган хүний гарц ба гарамтай хэсгийн гарцгүй зөрчил",
    "замын гэрэлтүүлэг хангалтгүй зөрчил",
    "замын нөхцөлөөс зөрчил",
    "замын тэмдэг тэмдэглэл байхгүй байсан зөрчил",
    "зан харьцаа зөрчил",
    "зогсолт зогсоолын журам зөрчсөн зөрчил",
    "зогсоох арга хэмжээ аваагүй зөрчил",
    "зөрчлийн талаар холбогдох байгууллагад шуурхай мэдээлээгүй зөрчил",
    "мал хариулгагүй зөрчил",
    "нийтээр дагаж мөрдөх хэм хэмжээ зөрчсөн зөрчил",
    "ойртон ирж яваа тээврийн хэрэгслийн урдуур гэнэт гүйсэн зөрчил",
    "согтуугаар тээврийн хэрэгсэл жолоодсон зөрчил",
    "техникийн гэмтлээс замын нөхцөл байдлаас зөрчил",
    "уулзвар гарц нэвтрэх журам зөрчсөн зөрчил",
    "ухрах үйлдэл буруу хийсэн зөрчил",
    "хажуу хоорондын зай тохируулаагүй зөрчил",
    "хамгаалах бүс хэрэглээгүй зөрчил",
    "хувь хүний ёс суртахууны төлөвшил зөрчил",
    "хурд тохируулаагүй зөрчил",
    "хурд хэтрүүлсэн зөрчил",
    "хяналт шалгалт сул зөрчил",
    "хүн ба ачаа тээвэрлэх журам зөрчсөн зөрчил",
    "эвдэж сүйтгэсэн зөрчил",
    "эгнээ байр буруу эзэлсэн зөрчил",
    "эргэх үйлдэл буруу хийсэн зөрчил",
    "эрхийн үнэмлэхгүй этгээд тээврийн хэрэгсэл жолоодсон зөрчил",
    "эсрэг урсгалд орох зөрчил",
    "эсрэг урсгалд орсон зөрчил",
    "явган хүний гарц ба гарамтай хэсгийн гарцгүй хэсгээр гарсан зөрчил",
    "үүргээ зохих ёсоор биелүүлээгүй зөрчил",
    "өөрийгөө хянаж зөрчил",
    "Дүүрэг",
    "Аймаг",
    "Авто зам - Замын харьяалал Нийслэлийн чанартай авто зам",
    "Авто зам - Замын харьяалал Орон нутгийн чанартай авто зам",
    "Авто зам - Замын харьяалал Иргэн аж ахуйн нэгж, байгууллагын дотоодын зам",
    "Авто зам - Замын харьяалал Улсын чанартай авто зам",
    "Авто зам - Замын харьяалал Хувийн зам",
    "Авто зам - Замын харьяалал Олон улсын чанартай авто зам",
    "Авто зам - Замын харьяалал Тусгай зориулалтын зам",
    "Авто зам - Замын ангилал Хорооллын",
    "Авто зам - Замын ангилал Ердийн",
    "Авто зам - Замын ангилал Тууш",
    "Авто зам - Замын ангилал Хурдны",
    "Авто зам - Замын гадаргуу Хуурай",
    "Авто зам - Замын гадаргуу Мөстэй",
    "Авто зам - Замын гадаргуу Нойтон",
    "Авто зам - Замын гадаргуу Цастай",
    "Авто зам - Замын гадаргуу Эдрэлтэй",
    "Авто зам - Замын гадаргуу Бохирдсон",
    "Авто зам - Замын онцлог Тэгш",
    "Авто зам - Замын онцлог Уруу",
    "Авто зам - Замын онцлог Өгсүүр",
    "Авто зам - Замын онцлог Шулуун",
    "Авто зам - Замын онцлог Хазгай",
    "Авто зам - Замын онцлог Огцом эргэлттэй",
    "Авто зам - Замын онцлог Налуу",
    "Авто зам - Замын онцлог Алсуур эргэлттэй",
    "Авто зам - Үзэгдэх орчин Чөлөөтэй",
    "Авто зам - Үзэгдэх орчин Зорчих хэсэг гэрэлтүүлэггүй",
    "Авто зам - Үзэгдэх орчин Зорчих хэсэг гэрэгтүүлэгтэй",
    "Авто зам - Үзэгдэх орчин Хязгаарлагдмал",
    "Авто зам - Үзэгдэх орчин Хангалтгүй",
    "Авто зам - Үзэгдэх орчин Бүрэнхий",
    "Авто зам - Үзэгдэх орчин Саад байсан",
    "Авто зам - Үзэгдэх орчин Манантай",
    "Авто зам - Цаг агаар Таатай",
    "Авто зам - Цаг агаар Үүлэрхэг",
    "Авто зам - Цаг агаар Цастай",
    "Авто зам - Цаг агаар Шуургатай",
    "Авто зам - Цаг агаар Манантай",
    "Авто зам - Цаг агаар Бороотой",
    "Авто зам - Бусад Өдөр",
    "Авто зам - Бусад Суурин газар",
    "Авто зам - Бусад Шөнө",
    "Авто зам - Бусад Суурингийн гаднах",
    "Авто зам - Бусад Аж ахуйн нэгж - Бусад",
    "Авто зам - Бусад Гудамж талбай - бусад",
    "Авто зам - Бусад Бусад газар - Өвөлжөө",
    "Авто зам - Бусад Бусад газар - Хөдөө хээр",
    "Авто зам - Бусад Бусад газар - Бусад",
    "Авто зам - Бусад Гудамж талбай - ил зогсоол",
    "Авто зам - Бусад Гудамж талбай - төмөр зам",
    "Авто зам - Бусад Гудамж талбай - гэр хорооллын гудамж",
    "Авто зам - Бусад Олон нийтийн газар - бөөний худалдааны төв",
    "Авто зам - Бусад Олон нийтийн газар - бусад",
    "Авто зам - Бусад Гудамж талбай - автобусны буудал",
    "Авто зам - Бусад Гудамж талбай - орон сууцны хорооллын гудамж",
    "Авто зам - Бусад эмнэлэг хувийн өмчийн",
    "Авто зам - Бусад Бусад газар - Бэлчээр",
    "Авто зам - Бусад Олон нийтийн газар - авто вокзал",
    "Авто зам - Бусад Бусад газар - Хаваржаа",
    "Авто зам - Бусад Олон нийтийн газар - дэлгүүр",
    "Авто зам - Бусад шатахуун түгээх станц",
    "Авто зам - Бусад Гэр, орон сууц - хувийн байшин",
    "Авто зам - Бусад Бусад газар - Зуслан",
    "Авто зам - Бусад Бусад газар - Ойн сан бүхий газар",
    "Авто зам - Бусад Бусад газар - Хилийн бүс",
    "Авто зам - Бусад Бусад газар - Гол, усны ай сав газар",
    "Авто зам - Бусад Олон нийтийн газар - амралтын газар",
    "Авто зам - Бусад Гэр, орон сууц - гэр",
    "Авто зам - Бусад Бусад газар - Намаржаа",
    "Авто зам - Бусад засвар, үйлчилгээний газар",
    "Авто зам - Бусад Гэр, орон сууц - бусад",
    "Авто зам - Бусад Нийтийн тээвэр - галт тэрэг",
    "Авто зам - Бусад Бусад газар - Ашиглаж байгаа уурхай",
    "Авто зам - Бусад Гэр, орон сууц - орон сууцны байр",
    "Авто зам - Бусад Гэр, орон сууц - гарааш",
    "Авто зам - Бусад Бусад газар - Баригдаж байгаа барилга",
    "Авто зам - Бусад Олон нийтийн газар - нисэх онгоцны буудал",
    "Авто зам - Бусад Бусад газар - Гадаад улсад",
    "Авто зам - Бусад Бусад газар - Ашигт малтмалын орд газар",
    "Авто зам - Бусад Нийтийн тээвэр - том оврын автобус",
    "Авто зам - Бусад Олон нийтийн газар - төмөр замын вокзал",
    "Авто зам - Бусад эмнэлэг төрийн өмчийн",
    "Авто зам - Бусад Төрийн бус байгууллага - бусад",
    "Авто зам - Бусад Нийтийн тээвэр - нисэх онгоц",
    "Авто зам - Бусад АТМ",
    "Авто зам - Замын хэсэг Уулзвар",
    "Авто зам - Замын хэсэг Бусад",
    "Авто зам - Замын хэсэг Гүүр",
    "Авто зам - Замын хэсэг Автобусны буудал",
    "Авто зам - Замын хэсэг Гарц",
    "Авто зам - Замын хэсэг Хонгил",
    "Авто зам - Замын хэсэг Төмөр замын гарам",
    "Авто зам - Замын хэсэг Зорчих хэсэг",
    "Авто зам - Замын хэсэг Тусгаарлах зурвас",
    "Авто зам - Замын хэсэг Түр зам",
    "Авто зам - Замын хэсэг Явган хүний зам дээр",
    "Авто зам - Замын хэсэг Сургууль орчимын зам",
    "Авто зам - Замын хэсэг Зогсоолын талбай",
    "Авто зам - Замын хэсэг Зорчих хэсгийн хөвөө",
    "Авто зам - Замын хэсэг Туслах зам",
    "Авто зам - Замын хэсэг Зам, барилгын ажлын талбай",
    "Авто зам - Ослын ноцтой байдал Хөнгөн гэмтэл авсан осол",
    "Авто зам - Ослын ноцтой байдал Хүнд, хүндэвтэр гэмтэл авсан осол",
    "Авто зам - Ослын ноцтой байдал Хүн нас барсан осол",
    "Авто зам - Ослын ноцтой байдал Эд материалын хохиролтой осол",
    "Авто зам - Ослын ноцтой байдал Гэмтэл бэртэл аваагүй осол",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Зам дээр саад байсан",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Гэрэл шилжүүлээгүй",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Хэт ядарсанаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Согтуугаар тээврийн хэрэгсэл жолоодсоноос",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Нойрмоглосоноос",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Замын нөхцөлөөс",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Гар утас хэрэглэж байснаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Буруу дохио, анхааруулга өгсөн",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Замын гадаргуу хальтиргаа, гулгаатай",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Сэтгэл зүйн байдлаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Дугуйн зам байхгүй байснаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Зам орчин хангалтгүй байсанаас",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Эрхэлсэн ажил мэргэжилээс",
    "Авто зам - Осолд нөлөөлөх хүчин зүйл Мансуурсанаас",
    "Авто зам - Ослын нөхцөл Хоёр тээврийн хэрэгсэл холбогдсон осол",
    "Авто зам - Ослын нөхцөл Нэг тээврийн хэрэгсэл холбогдсон осол",
    "Авто зам - Ослын нөхцөл Гурав бас түүнээс дээш тээврийн хэрэгсэл холбогдсон осол",]

st.header("Категори хувьсагчдын хоорондын хамаарал (Cramér’s V & Chi-square)")

var1 = st.selectbox("1-р категори хувьсагч:", categorical_cols)
var2 = st.selectbox("2-р категори хувьсагч:", [c for c in categorical_cols if c != var1])





from scipy.stats import chi2_contingency

if var1 and var2:
    table = pd.crosstab(df[var1], df[var2])

    # Chi-square
    chi2, p, dof, expected = chi2_contingency(table)

    # Cramér’s V
    n = table.values.sum()
    r, k = table.shape
    cramers_v = np.sqrt(chi2 / (n * (min(k, r) - 1))) if min(k, r) > 1 else np.nan

    st.subheader("1. Chi-square тест")
    st.write(f"**Chi-square statistic:** {chi2:.3f}")
    st.write(f"**p-value:** {p:.4f}")
    if p < 0.05:
        st.success("p < 0.05 → Статистикийн хувьд хамааралтай!")
    else:
        st.info("p ≥ 0.05 → Статистикийн хувьд хамааралгүй.")

    st.subheader("2. Cramér’s V")
    st.write(f"**Cramér’s V:** {cramers_v:.3f} (0=хамааралгүй, 1=хүчтэй хамаарал)")
    if cramers_v < 0.1:
        st.info("Хамааралгүй бараг")
    elif cramers_v < 0.3:
        st.info("Сул хамааралтай")
    elif cramers_v < 0.5:
        st.info("Дунд зэрэг хамааралтай")
    else:
        st.success("Их хамааралтай")
    
    # Crosstab харуулах
    st.write("**Crosstab:**")
    st.dataframe(table)